*** src/validation.rs:108:48: delete ! in validate_password

*** mutation diff:
--- src/validation.rs
+++ delete ! in validate_password
@@ -100,17 +100,17 @@
             "Password must be at least {} characters long.",
             MIN_PASSWORD_LENGTH
         )));
     }
 
     let has_uppercase = password.chars().any(char::is_uppercase);
     let has_lowercase = password.chars().any(char::is_lowercase);
     let has_numeric = password.chars().any(char::is_numeric);
-    let has_special = password.chars().any(|c| !c.is_alphanumeric());
+    let has_special = password.chars().any(|c|  /* ~ changed by cargo-mutants ~ */c.is_alphanumeric());
 
     let complexity_score =
         has_uppercase as u8 + has_lowercase as u8 + has_numeric as u8 + has_special as u8;
 
     if complexity_score < MIN_COMPLEXITY_SCORE {
         return Err(CryptorError::PasswordValidation(
             format!("Password must contain at least {} of the following categories: uppercase, lowercase, numbers, special characters.", MIN_COMPLEXITY_SCORE)
         ));

*** result: Success
