*** src/validation.rs:111:51: replace + with - in validate_password

*** mutation diff:
--- src/validation.rs
+++ replace + with - in validate_password
@@ -103,17 +103,17 @@
     }
 
     let has_uppercase = password.chars().any(char::is_uppercase);
     let has_lowercase = password.chars().any(char::is_lowercase);
     let has_numeric = password.chars().any(char::is_numeric);
     let has_special = password.chars().any(|c| !c.is_alphanumeric());
 
     let complexity_score =
-        has_uppercase as u8 + has_lowercase as u8 + has_numeric as u8 + has_special as u8;
+        has_uppercase as u8 + has_lowercase as u8 - /* ~ changed by cargo-mutants ~ */ has_numeric as u8 + has_special as u8;
 
     if complexity_score < MIN_COMPLEXITY_SCORE {
         return Err(CryptorError::PasswordValidation(
             format!("Password must contain at least {} of the following categories: uppercase, lowercase, numbers, special characters.", MIN_COMPLEXITY_SCORE)
         ));
     }
 
     Ok(())

---- validation::tests::test_password_low_complexity stdout ----

thread 'validation::tests::test_password_low_complexity' (17427) panicked at src/validation.rs:111:9:
attempt to subtract with overflow

---- validation::tests::test_password_exactly_min_length stdout ----

thread 'validation::tests::test_password_exactly_min_length' (17426) panicked at src/validation.rs:154:9:
assertion failed: validate_password("Abcdefgh123!").is_ok()

---- tests::test_encrypt_file_validated stdout ----

thread 'tests::test_encrypt_file_validated' (17425) panicked at src/lib.rs:375:9:
assertion failed: result.is_ok()

failures:
    tests::test_encrypt_file_validated
    validation::tests::test_password_exactly_min_length
    validation::tests::test_password_low_complexity
    validation::tests::test_password_unicode
    validation::tests::test_password_valid_four_types
    validation::tests::test_password_valid_three_types

test result: FAILED. 373 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 129.00s

*** result: Failure(101)
