*** src/validation.rs:111:71: replace + with - in validate_password

*** mutation diff:
--- src/validation.rs
+++ replace + with - in validate_password
@@ -103,17 +103,17 @@
     }
 
     let has_uppercase = password.chars().any(char::is_uppercase);
     let has_lowercase = password.chars().any(char::is_lowercase);
     let has_numeric = password.chars().any(char::is_numeric);
     let has_special = password.chars().any(|c| !c.is_alphanumeric());
 
     let complexity_score =
-        has_uppercase as u8 + has_lowercase as u8 + has_numeric as u8 + has_special as u8;
+        has_uppercase as u8 + has_lowercase as u8 + has_numeric as u8 - /* ~ changed by cargo-mutants ~ */ has_special as u8;
 
     if complexity_score < MIN_COMPLEXITY_SCORE {
         return Err(CryptorError::PasswordValidation(
             format!("Password must contain at least {} of the following categories: uppercase, lowercase, numbers, special characters.", MIN_COMPLEXITY_SCORE)
         ));
     }
 
     Ok(())


