*** src/validation.rs:113:25: replace < with > in validate_password

*** mutation diff:
--- src/validation.rs
+++ replace < with > in validate_password
@@ -105,17 +105,17 @@
     let has_uppercase = password.chars().any(char::is_uppercase);
     let has_lowercase = password.chars().any(char::is_lowercase);
     let has_numeric = password.chars().any(char::is_numeric);
     let has_special = password.chars().any(|c| !c.is_alphanumeric());
 
     let complexity_score =
         has_uppercase as u8 + has_lowercase as u8 + has_numeric as u8 + has_special as u8;
 
-    if complexity_score < MIN_COMPLEXITY_SCORE {
+    if complexity_score > /* ~ changed by cargo-mutants ~ */ MIN_COMPLEXITY_SCORE {
         return Err(CryptorError::PasswordValidation(
             format!("Password must contain at least {} of the following categories: uppercase, lowercase, numbers, special characters.", MIN_COMPLEXITY_SCORE)
         ));
     }
 
     Ok(())
 }

---- validation::tests::test_password_unicode stdout ----

thread 'validation::tests::test_password_unicode' (10269) panicked at src/validation.rs:160:9:
assertion failed: validate_password("Abcdefgh123😀").is_ok()

---- tests::test_encrypt_file_validated stdout ----

thread 'tests::test_encrypt_file_validated' (10265) panicked at src/lib.rs:375:9:
assertion failed: result.is_ok()

---- validation::tests::test_password_low_complexity stdout ----

thread 'validation::tests::test_password_low_complexity' (10267) panicked at src/validation.rs:133:9:
assertion failed: validate_password("alllowercase").is_err()

failures:
    tests::test_encrypt_file_validated
    validation::tests::test_password_exactly_min_length
    validation::tests::test_password_low_complexity
    validation::tests::test_password_unicode
    validation::tests::test_password_valid_four_types

test result: FAILED. 374 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 130.36s

*** result: Failure(101)
