*** src/validation.rs:113:25: replace < with <= in validate_password

*** mutation diff:
--- src/validation.rs
+++ replace < with <= in validate_password
@@ -105,17 +105,17 @@
     let has_uppercase = password.chars().any(char::is_uppercase);
     let has_lowercase = password.chars().any(char::is_lowercase);
     let has_numeric = password.chars().any(char::is_numeric);
     let has_special = password.chars().any(|c| !c.is_alphanumeric());
 
     let complexity_score =
         has_uppercase as u8 + has_lowercase as u8 + has_numeric as u8 + has_special as u8;
 
-    if complexity_score < MIN_COMPLEXITY_SCORE {
+    if complexity_score <= /* ~ changed by cargo-mutants ~ */ MIN_COMPLEXITY_SCORE {
         return Err(CryptorError::PasswordValidation(
             format!("Password must contain at least {} of the following categories: uppercase, lowercase, numbers, special characters.", MIN_COMPLEXITY_SCORE)
         ));
     }
 
     Ok(())
 }

---- validation::tests::test_password_valid_three_types stdout ----

thread 'validation::tests::test_password_valid_three_types' (37169) panicked at src/validation.rs:140:9:
assertion failed: validate_password("Abcdefghij12").is_ok()

failures:
    validation::tests::test_password_valid_three_types

test result: FAILED. 378 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 131.08s

*** result: Failure(101)
