*** src/validation.rs:41:5: replace get_and_validate_password -> Result<Zeroizing<String>> with Ok(Zeroizing::new(String::new()))

*** mutation diff:
--- src/validation.rs
+++ replace get_and_validate_password -> Result<Zeroizing<String>> with Ok(Zeroizing::new(String::new()))
@@ -33,33 +33,17 @@
 /// - I/O error occurs during input
 ///
 /// # Security
 ///
 /// - Uses zeroizing memory to prevent password leakage
 /// - Constant-time comparison to prevent timing attacks
 #[cfg(not(target_arch = "wasm32"))]
 pub fn get_and_validate_password() -> Result<Zeroizing<String>> {
-    print!("Enter a strong password: ");
-    std::io::stdout().flush()?;
-    let pass1 = Zeroizing::new(read_password()?);
-
-    validate_password(&pass1)?;
-
-    print!("Confirm password: ");
-    std::io::stdout().flush()?;
-    let pass2 = Zeroizing::new(read_password()?);
-
-    if !bool::from(pass1.as_bytes().ct_eq(pass2.as_bytes())) {
-        return Err(CryptorError::PasswordValidation(
-            "Passwords do not match.".to_string(),
-        ));
-    }
-
-    Ok(pass1)
+    Ok(Zeroizing::new(String::new())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Prompts the user for a password without validation (for decryption).
 ///
 /// # Errors
 ///
 /// Returns an error if I/O error occurs during input.
 #[cfg(not(target_arch = "wasm32"))]

*** result: Success
