*** src/validation.rs:67:5: replace get_password -> Result<Zeroizing<String>> with Ok(Zeroizing::new(String::new()))

*** mutation diff:
--- src/validation.rs
+++ replace get_password -> Result<Zeroizing<String>> with Ok(Zeroizing::new(String::new()))
@@ -59,19 +59,17 @@
 
 /// Prompts the user for a password without validation (for decryption).
 ///
 /// # Errors
 ///
 /// Returns an error if I/O error occurs during input.
 #[cfg(not(target_arch = "wasm32"))]
 pub fn get_password() -> Result<Zeroizing<String>> {
-    print!("Enter password: ");
-    std::io::stdout().flush()?;
-    Ok(Zeroizing::new(read_password()?))
+    Ok(Zeroizing::new(String::new())) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Enforces strong password requirements.
 ///
 /// Password must:
 /// - Be at least 12 characters long
 /// - Contain at least 3 of the following:
 ///   - Uppercase letters

*** result: Success
