*** src/validation.rs:98:23: replace < with > in validate_password

*** mutation diff:
--- src/validation.rs
+++ replace < with > in validate_password
@@ -90,17 +90,17 @@
 /// # Examples
 ///
 /// ```
 /// # use tesseract_lib::validation::validate_password;
 /// assert!(validate_password("Abcdef123!@#").is_ok());
 /// assert!(validate_password("weak").is_err());
 /// ```
 pub fn validate_password(password: &str) -> Result<()> {
-    if password.len() < MIN_PASSWORD_LENGTH {
+    if password.len() > /* ~ changed by cargo-mutants ~ */ MIN_PASSWORD_LENGTH {
         return Err(CryptorError::PasswordValidation(format!(
             "Password must be at least {} characters long.",
             MIN_PASSWORD_LENGTH
         )));
     }
 
     let has_uppercase = password.chars().any(char::is_uppercase);
     let has_lowercase = password.chars().any(char::is_lowercase);

---- validation::tests::test_password_unicode stdout ----

thread 'validation::tests::test_password_unicode' (31795) panicked at src/validation.rs:160:9:
assertion failed: validate_password("Abcdefgh123😀").is_ok()

---- validation::tests::test_password_valid_four_types stdout ----

thread 'validation::tests::test_password_valid_four_types' (31796) panicked at src/validation.rs:149:9:
assertion failed: validate_password("MyP@ssw0rd123").is_ok()

---- validation::tests::test_password_valid_three_types stdout ----

thread 'validation::tests::test_password_valid_three_types' (31797) panicked at src/validation.rs:142:9:
assertion failed: validate_password("abcdefghij12!").is_ok()

failures:
    tests::test_encrypt_file_validated
    validation::tests::test_password_too_short
    validation::tests::test_password_unicode
    validation::tests::test_password_valid_four_types
    validation::tests::test_password_valid_three_types

test result: FAILED. 374 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 129.61s

*** result: Failure(101)
