*** src/validation.rs:98:5: replace validate_password -> Result<()> with Ok(())

*** mutation diff:
--- src/validation.rs
+++ replace validate_password -> Result<()> with Ok(())
@@ -90,38 +90,17 @@
 /// # Examples
 ///
 /// ```
 /// # use tesseract_lib::validation::validate_password;
 /// assert!(validate_password("Abcdef123!@#").is_ok());
 /// assert!(validate_password("weak").is_err());
 /// ```
 pub fn validate_password(password: &str) -> Result<()> {
-    if password.len() < MIN_PASSWORD_LENGTH {
-        return Err(CryptorError::PasswordValidation(format!(
-            "Password must be at least {} characters long.",
-            MIN_PASSWORD_LENGTH
-        )));
-    }
-
-    let has_uppercase = password.chars().any(char::is_uppercase);
-    let has_lowercase = password.chars().any(char::is_lowercase);
-    let has_numeric = password.chars().any(char::is_numeric);
-    let has_special = password.chars().any(|c| !c.is_alphanumeric());
-
-    let complexity_score =
-        has_uppercase as u8 + has_lowercase as u8 + has_numeric as u8 + has_special as u8;
-
-    if complexity_score < MIN_COMPLEXITY_SCORE {
-        return Err(CryptorError::PasswordValidation(
-            format!("Password must contain at least {} of the following categories: uppercase, lowercase, numbers, special characters.", MIN_COMPLEXITY_SCORE)
-        ));
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_password_too_short() {

---- validation::tests::test_password_too_short stdout ----

thread 'validation::tests::test_password_too_short' (24601) panicked at src/validation.rs:107:9:
assertion failed: validate_password("Short1!").is_err()

---- validation::tests::test_password_low_complexity stdout ----

thread 'validation::tests::test_password_low_complexity' (24600) panicked at src/validation.rs:112:9:
assertion failed: validate_password("alllowercase").is_err()

---- tests::test_encrypt_file_validated stdout ----

thread 'tests::test_encrypt_file_validated' (24598) panicked at src/lib.rs:371:9:
assertion failed: result.is_err()

failures:
    tests::test_encrypt_file_validated
    validation::tests::test_password_low_complexity
    validation::tests::test_password_too_short

test result: FAILED. 376 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 129.89s

*** result: Failure(101)
